In [1]:
import pandas as pd

In [2]:
num_list = [1,2,3,4,5]

series = pd.Series(num_list)

print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
import numpy as np

arr = np.array([1,2,3,4,5])

series = pd.Series(arr,index=['I','II','III','IV','V'])

print(series)

I      1
II     2
III    3
IV     4
V      5
dtype: int64

In [11]:
data = {'A':20,'B':30,'C':40, 'D':50, 'E':60}

series = pd.Series(data)

print(series)

A    20
B    30
C    40
D    50
E    60
dtype: int64

In [8]:
print(series['B'])

30

In [14]:
series['A':'B']

A    20
B    30
dtype: int64

In [15]:
series_1 = pd.Series([1,2,3,4,5])

series_2 = pd.Series([6,7,8,9,10])

In [16]:
sum_series = series_1 + series_2

In [17]:
sum_series

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [22]:
sum_series[(sum_series> 10) | (sum_series < 15)]

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [23]:
data = {
    "Name":["Alice","Bob","Charlie","David","Eva"],
    "Age":[25,30,35,40,45],
    "City":["New York","Los Angeles","Chicago","Houston","Miami"]
}

df = pd.DataFrame(data)

print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45        Miami

In [24]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45        Miami

In [25]:
df.head(3)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [26]:
df.tail(3)

      Name  Age     City
2  Charlie   35  Chicago
3    David   40  Houston
4      Eva   45    Miami

In [55]:
df = pd.read_csv('/home/ilab/Documents/PCPS/notebooks/data-science-with-ai-2025/data/data.csv')

In [30]:
df[['Name','Age']]

    Name  Age
0    Ram   21
1  Shyam   22
2   Hari   21

In [33]:
df.loc[1:2,['Age']]

   Age
1   22
2   21

In [35]:
df.iloc[0:2,1]

0    21
1    22
Name: Age, dtype: int64

In [36]:
df

    Name  Age  Marks
0    Ram   21     90
1  Shyam   22     95
2   Hari   21     80

In [41]:
df[(df['Marks']>80) & (df["Age"]>21)]

    Name  Age  Marks
1  Shyam   22     95

In [44]:
df

    Name  Age  Marks
0    Ram   21     90
1  Shyam   22     95
2   Hari   21     80

In [43]:
old_df = df.copy()

In [56]:
df['Salary'] = [10000,30000,15000]

In [46]:
df

    Name  Age  Marks  Salary
0    Ram   21     90   10000
1  Shyam   22     95   30000
2   Hari   21     80   15000

In [47]:
old_df

    Name  Age  Marks
0    Ram   21     90
1  Shyam   22     95
2   Hari   21     80

In [49]:
df.dtypes

Name      object
Age        int64
Marks      int64
Salary     int64
dtype: object

In [57]:
print(df[['Age','Marks','Salary']].min())

print(df[['Age','Marks','Salary']].max())

print(df[['Age','Marks','Salary']].mean())

print(df[['Age','Marks','Salary']].median())

Age          21
Marks        80
Salary    10000
dtype: int64
Age          22
Marks        95
Salary    30000
dtype: int64
Age          21.333333
Marks        88.333333
Salary    18333.333333
dtype: float64
Age          21.0
Marks        90.0
Salary    15000.0
dtype: float64

In [5]:
import pandas as pd

data = {
    "name": ["Alice", "Bob", "Charlie", "David", "Eve", "Frank"],
    "age": [25, 30, 35, 40, 45, 50],
    "city": ["Houston", "Chicago", "Chicago", "Houston", "Miami", "Miami"],
    "salary": [50000, 60000, 70000, 80000, 90000, 100000]
}

df = pd.DataFrame(data)
df

      name  age     city  salary
0    Alice   25  Houston   50000
1      Bob   30  Chicago   60000
2  Charlie   35  Chicago   70000
3    David   40  Houston   80000
4      Eve   45    Miami   90000
5    Frank   50    Miami  100000

In [7]:
df.groupby('city')['name'].count()

city
Chicago    2
Houston    2
Miami      2
Name: name, dtype: int64